In [1]:
import pandas as pd
#Define a dictionary Name, Marks and Gender
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }

type(dict1)
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [2]:
#Get Top 3 records
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [3]:
#Get last 3 rows of dataset
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [4]:
#Find shape of our Our Dataset, #of rows and # of columns
df1.shape

(7, 3)

In [5]:
print("# of rows",df1.shape[0])
print("# of Columns",df1.shape[1])

# of rows 7
# of Columns 3

In [6]:
#Get information about dataset, # of rows/columns, datatype of each column, memory requirement etc.
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [7]:
#check null values in dataset
df1.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [8]:
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [9]:
#axis=0 is default, means sum by column i.e. axis=0
df1.isnull().sum(axis=0)

Name      0
Marks     0
Gender    0
dtype: int64

In [10]:
#axis=1 means sum by rows i.e. axis=1
df1.isnull().sum(axis=1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [11]:
#Get overall statistics about the dataset. Valid only for numeric. If you nedd for non-numerica allso, use include='all'

df1.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [12]:
df1.describe(include='all')
#NaN means not a number

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

In [13]:
#Find Unique values from gender
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [14]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [15]:
#Find number of unique values from gender
df1['Gender'].nunique()

2

In [16]:
#Display count of unique values in Gender
df1['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

In [17]:
#Find Total Number of Students having marks between 70 and 90, with between and without between method
df1['Marks']>=90

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [19]:
df1[df1['Marks']>=90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [22]:
# for and operation use & and for OR operation use |
df1[(df1['Marks']>=90) & (df1['Marks']<=100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [23]:
len(df1[(df1['Marks']>=90) & (df1['Marks']<=100)])

4

In [30]:
sum((df1['Marks']>=90) & (df1['Marks']<=100))

4

In [25]:
#using between
df1[df1['Marks'].between(90,100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [26]:
len(df1[df1['Marks'].between(90,100)])

4

In [28]:
sum(df1['Marks'].between(90,100))

4

In [47]:
#Find average of the marks. Average is mean. can also find min, max, median, mode
print("Mean\t ",df1['Marks'].mean(),"\nMedian\t ",df1['Marks'].median(),"\nMode\t",df1['Marks'].mode(),"\nMax\t",df1['Marks'].max(),"\nMin\t",df1['Marks'].min())

Mean	  92.14285714285714
Median	  90.0
Mode	 0    99
dtype: int64
Max	 99
Min	 83

In [67]:
#Using apply method
import math
def marks(x):
    return(math.sqrt(x*x))

In [68]:
df1['Marks'].apply(marks)

0    98.0
1    89.0
2    99.0
3    87.0
4    90.0
5    83.0
6    99.0
Name: Marks, dtype: float64

In [69]:
df1['SQRT_SQUARE']=df1['Marks'].apply(marks)

In [70]:
df1

      Name  Marks  Gender  SQRT_SQUARE
0  Priyang     98    Male         98.0
1   Aadhya     89  Female         89.0
2   Krisha     99  Female         99.0
3   Vedant     87    Male         87.0
4   Parshv     90    Male         90.0
5   Mittal     83  Female         83.0
6  Archana     99  Female         99.0

In [71]:
df1['Marks'].apply(lambda x:math.sqrt(x*x))

0    98.0
1    89.0
2    99.0
3    87.0
4    90.0
5    83.0
6    99.0
Name: Marks, dtype: float64

In [75]:
#find length of strings in table
df1['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

In [79]:
#Use map function to convert gender into numeric
df1['Gender'].map({'Male':1,'Female':0})

0    1
1    0
2    0
3    1
4    1
5    0
6    0
Name: Gender, dtype: int64

In [81]:
#{}use to give multiple parameters, called as python lists
df1['Male_Female']=df1['Gender'].map({'Male':1,'Female':0})

In [82]:
df1

      Name  Marks  Gender  SQRT_SQUARE  Male_Female
0  Priyang     98    Male         98.0            1
1   Aadhya     89  Female         89.0            0
2   Krisha     99  Female         99.0            0
3   Vedant     87    Male         87.0            1
4   Parshv     90    Male         90.0            1
5   Mittal     83  Female         83.0            0
6  Archana     99  Female         99.0            0

In [85]:
#Drop the column(s)
df1.drop({"Male_Female","SQRT_SQUARE"},axis=1)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [86]:
#If you need to modify existing dataframe after doing deletion use inplace=TRUE
df1

      Name  Marks  Gender  SQRT_SQUARE  Male_Female
0  Priyang     98    Male         98.0            1
1   Aadhya     89  Female         89.0            0
2   Krisha     99  Female         99.0            0
3   Vedant     87    Male         87.0            1
4   Parshv     90    Male         90.0            1
5   Mittal     83  Female         83.0            0
6  Archana     99  Female         99.0            0

In [88]:
df1.drop({"Male_Female","SQRT_SQUARE"},axis=1,inplace=True)

In [89]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [90]:
#Print column names, .columns is not a method, but attribute
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [91]:
#To find the index where these columns are
df1.index

RangeIndex(start=0, stop=7, step=1)

In [94]:
#Sort the DataFrame as per Marks column
df1.sort_values(by="Marks") #USE SHIFT+TAB to get different parameters

      Name  Marks  Gender
5   Mittal     83  Female
3   Vedant     87    Male
1   Aadhya     89  Female
4   Parshv     90    Male
0  Priyang     98    Male
2   Krisha     99  Female
6  Archana     99  Female

In [107]:
df1.sort_values(by="Marks",ascending=True)

      Name  Marks  Gender
5   Mittal     83  Female
3   Vedant     87    Male
1   Aadhya     89  Female
4   Parshv     90    Male
0  Priyang     98    Male
2   Krisha     99  Female
6  Archana     99  Female

In [113]:
#To sort with multiple columns use python list []
df1.sort_values(by=['Marks','Name'],ascending=True)

      Name  Marks  Gender
5   Mittal     83  Female
3   Vedant     87    Male
1   Aadhya     89  Female
4   Parshv     90    Male
0  Priyang     98    Male
6  Archana     99  Female
2   Krisha     99  Female

In [117]:
#Display name and marks of female students
df1[df1["Gender"]=="Female"]

      Name  Marks  Gender
1   Aadhya     89  Female
2   Krisha     99  Female
5   Mittal     83  Female
6  Archana     99  Female

In [118]:
df1[df1["Gender"]=="Female"][["Name","Marks"]]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99